In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
# establish a database connection
engine = create_engine("postgresql+psycopg2://postgres:postgres@localhost:5432/lahman_baseball")

In [3]:
# use the connection to run a query using pandas!
batting = pd.read_sql("SELECT * FROM batting;", con=engine)
batting.head()

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,h2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,abercda01,1871,1,TRO,NA,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NA,29,137,28,40,4,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NA,27,133,28,44,10,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NA,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

In [4]:
people = pd.read_sql("SELECT * FROM people;", con=engine)
collegeplaying = pd.read_sql("SELECT * FROM collegeplaying;", con=engine)
schools = pd.read_sql("SELECT * FROM schools;", con=engine)
salaries = pd.read_sql("SELECT * FROM salaries;", con=engine)
collegeplaying

        playerid  schoolid  yearid
0      aardsda01    pennst    2001
1      aardsda01      rice    2002
2      aardsda01      rice    2003
3       abadan01   gamiddl    1992
4       abadan01   gamiddl    1993
...          ...       ...     ...
17345  zupcibo01   oralrob    1987
17346  zuvelpa01  stanford    1977
17347  zuvelpa01  stanford    1978
17348  zuvelpa01  stanford    1979
17349  zuvelpa01  stanford    1980

[17350 rows x 3 columns]

In [5]:
merged = people.merge(collegeplaying, left_on ='playerid', right_on = 'playerid',how='inner', indicator = False)
merged = merged.merge(schools, left_on ='schoolid', right_on = 'schoolid',how='inner', indicator = False)
merged = merged.merge(salaries, left_on ='playerid', right_on = 'playerid',how='inner', indicator = False)

merged

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,schoolid,yearid_x,schoolname,schoolcity,schoolstate,schoolnick,yearid_y,teamid,lgid,salary
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,pennst,2001,Pennsylvania State University,State College,PA,USA,2004,SFN,NL,300000.0
1,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,pennst,2001,Pennsylvania State University,State College,PA,USA,2007,CHA,AL,387500.0
2,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,pennst,2001,Pennsylvania State University,State College,PA,USA,2008,BOS,AL,403250.0
3,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,pennst,2001,Pennsylvania State University,State College,PA,USA,2009,SEA,AL,419000.0
4,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,pennst,2001,Pennsylvania State University,State College,PA,USA,2010,SEA,AL,2750000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
38393,yatesty01,1977.0,8.0,7.0,USA,HI,Lihue,NaN,NaN,NaN,...,hawaiihilo,1998,University of Hawaii at Hilo,Hilo,HI,USA,2004,NYN,NL,300000.0
38394,yatesty01,1977.0,8.0,7.0,USA,HI,Lihue,NaN,NaN,NaN,...,hawaiihilo,1998,University of Hawaii at Hilo,Hilo,HI,USA,2005,NYN,NL,319500.0
38395,yatesty01,1977.0,8.0,7.0,USA,HI,Lihue,NaN,NaN,NaN,...,hawaiihilo,1998,University of Hawaii at Hilo,Hilo,HI,USA,2007,ATL,NL,412500.0
38396,yatesty01,1977.0,8.0,7.0,USA,HI,Lihue,NaN,NaN,NaN,...,hawaiihilo,1998,University of Hawaii at Hilo,Hilo,HI,USA,2008,PIT,NL,800000.0
38397,yatesty01,1977.0,8.0,7.0,USA,HI,Lihue,NaN,NaN,NaN,...,hawaiihilo,1998,University of Hawaii at Hilo,Hilo,HI,USA,2009,PIT,NL,1300000.0

In [28]:
#filter where id is Vanderbilt
vandy = merged[merged['schoolid'].str.contains('vandy',regex=False)]

#choosen columns
vandy = vandy[['playerid','namefirst', 'namelast', 'salary']]

#group 
vandy_grouped = vandy.groupby(['playerid'], as_index=False)['salary'].sum()
vandy_grouped['total_salary'] = vandy['salary']

#combine
vandy = vandy.merge(vandy_grouped, left_on ='playerid', right_on = 'playerid',how='inner', indicator = False)
vandy

      playerid namefirst   namelast   salary_x    salary_y  total_salary
0    priorma01      Mark      Prior  1450000.0  12800000.0           NaN
1    priorma01      Mark      Prior  3150000.0  12800000.0           NaN
2    priorma01      Mark      Prior  3550000.0  12800000.0           NaN
3    priorma01      Mark      Prior  3650000.0  12800000.0           NaN
4    priorma01      Mark      Prior  1000000.0  12800000.0           NaN
..         ...       ...        ...        ...         ...           ...
193  sandesc01     Scott  Sanderson   250000.0  21500000.0           NaN
194  sandesc01     Scott  Sanderson   200000.0  21500000.0           NaN
195  sowerje01    Jeremy     Sowers   384800.0   1154400.0           NaN
196  sowerje01    Jeremy     Sowers   384800.0   1154400.0           NaN
197  sowerje01    Jeremy     Sowers   384800.0   1154400.0           NaN

[198 rows x 6 columns]

In [ ]:
# group salary by playerid